src/main/resources/AddAffliationtoEntity

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://rice.kuali.org/kim/v2_0">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:addAffiliationToEntity>
         <!--Optional:-->
         <v2:affiliation>
            <!--Optional:-->
            <v2:id>123456</v2:id>
            <!--Optional:-->
            <v2:entityId>U222222222</v2:entityId>
            <!--Optional:-->
            <v2:affiliationType>
               <v2:code>0003</v2:code>
               <!--Optional:-->
               <v2:name>NREP-Staff</v2:name>
               <!--Optional:-->
               <v2:active>true</v2:active>
               <v2:employmentAffiliationType>false</v2:employmentAffiliationType>
               <!--Optional:-->
               <!--Optional:-->
               <!--You may enter ANY elements at this point-->
            </v2:affiliationType>
            <!--Optional:-->
            <v2:campusCode>21</v2:campusCode>
            <v2:defaultValue>true</v2:defaultValue>
            <v2:active>true</v2:active>
            <!--Optional:-->
            <!--Optional:-->
            <!--You may enter ANY elements at this point-->
         </v2:affiliation>
      </v2:addAffiliationToEntity>
   </soapenv:Body>
</soapenv:Envelope>